src/Конфигурация/Documents/НазначениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>НазначениеСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенияСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>НазначениеНаДолжность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗанимаемойДолжности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидЗанимаемойДолжности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СнятиеСДолжности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Конфигурация/Documents/НазначениеСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДанныеВыбора(Данные, ВыбранноеЗначение)
	Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
	Данные.Должность = ВыбранноеЗначение.Должность;
	Если Данные.Свойство("ВидЗанимаемойДолжности") Тогда
		Данные.ВидЗанимаемойДолжности = ВыбранноеЗначение.ВидНазначения;
	КонецЕсли; 
КонецПроцедуры
 

&НаКлиенте
Процедура СнятиеСДолжностиДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.СнятиеСДолжности.ТекущиеДанные
		, Элемент
		, Новый Структура("Сотрудник,Период")
	);
КонецПроцедуры
&НаКлиенте
Процедура СнятиеСДолжностиДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСДолжностиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.СнятиеСДолжности.ТекущиеДанные
		, Элемент
		, Новый Структура("Должность,Период")
	);
КонецПроцедуры
&НаКлиенте
Процедура СнятиеСДолжностиСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСДолжностиДатаПриИзменении(Элемент)
	Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
	Данные.Должность = Неопределено;	
КонецПроцедуры
